formal_method_tla.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Formal Method with TLA</title>
<!-- 2016-05-11 Wed 15:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Alan O Hung Lun" />
</head>
<body>
<div id="content">
<h1 class="title">Formal Method with TLA</h1>
<p>
Amazon's successful experience with using formal method on their distributed system inspires me to take a second look at its practicality. 
Amazon uses TLA+ developed by Microsoft Research to specify their system and perform modal checking on the specification. In the process, the Amazon engineers uncovered several critical bugs, which would have otherwise remained hidden from other testing methods.
</p>

<p>
I am in the process of studying TLA+. 
</p>

<p>
Here is a toy example of how formal method would work.
</p>

<p>
Given a formal specification of a hour clock, such as this
</p>

<div class="org-src-container">

<pre class="src src-C">---------------------- MODULE HourClock ----------------------
EXTENDS Naturals
VARIABLE hr
HCini  ==  hr \in (1 .. 12)
HCnxt  ==  hr' = IF hr # 12 THEN hr + 1 ELSE 1
HC  ==  HCini /\ [][HCnxt]_hr
==============================================================
</pre>
</div>

<p>
We want to know if the variable hr is always within the set {1,2,3,..12}, no matter how long the clock runs.
Given the specification of hour clock, we run the model checker and find that there is no error. In this case,
hr is always in {1,2,3..12} is called Invariant.
</p>

<p>
If we set the Invariant to be
</p>
<pre class="example">
hr is always in {1,2,3}
</pre>
<p>
then the model checker will throw up 9 errors:
Property hr &isin; {1,2,3} is violated by the initial state:
</p>

<div class="org-src-container">

<pre class="src src-C">hr = 4

Property hr \in {1,2,3} is violated by the initial state:
hr = 5

Property hr \in {1,2,3} is violated by the initial state:
hr = 6

Property hr \in {1,2,3} is violated by the initial state:
hr = 7

Property hr \in {1,2,3} is violated by the initial state:
hr = 8

Property hr \in {1,2,3} is violated by the initial state:
hr = 9

Property hr \in {1,2,3} is violated by the initial state:
hr = 10

Property hr \in {1,2,3} is violated by the initial state:
hr = 11

Property hr \in {1,2,3} is violated by the initial state:
hr = 12
</pre>
</div>


<p>
This toy example illustrates the principle of formal specification and model checking. When the same principle is applied to more complicated system, we have a tool to check its safety critical properties automatically. 
</p>

<p>
TLA+ webpage: <a href="http://research.microsoft.com/en-us/um/people/lamport/tla/tla.html">http://research.microsoft.com/en-us/um/people/lamport/tla/tla.html</a>
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alan O Hung Lun</p>
<p class="date">Date: 2016-05-11 Wed 15:11</p>
</div>
</body>
</html>
